Revit 2027 API
ParameterTypeId.PathReinEndHookOrient1Slab Property
 "Primary Bar - End Hook Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PathReinEndHookOrient1Slab { get; }
Public Shared ReadOnly Property PathReinEndHookOrient1Slab As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PathReinEndHookOrient1Slab {
	ForgeTypeId^ get ();
}
static member PathReinEndHookOrient1Slab : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace